In [3]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [4]:
%%sql
SELECT *
 FROM sqlite_master
    WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql
SELECT *
  FROM facts
    LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [8]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
   FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [16]:
%%sql
SELECT name
    FROM facts
    WHERE population = (SELECT MIN(population) FROM facts);

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [15]:
%%sql
SELECT name
 FROM facts
    WHERE population = (SELECT MAX(population) FROM facts);

 * sqlite:///factbook.db
Done.

[('World',)]

What is the maximum population and the maximum population growth?

In [18]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
 FROM facts
WHERE name <> 'World'

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

What is the average population and average area of all the countries?

In [21]:
%%sql
SELECT AVG(population), AVG(area)
FROM facts
WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

Which countries have population higher than the average population?

In [23]:
%%sql
SELECT name
FROM facts
WHERE population > (SELECT AVG(population) FROM facts WHERE name <> 'World') AND area < (SELECT AVG(area) FROM facts WHERE name <> 'World');

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]

Which country has the highest growth rate?

In [25]:
%%sql
SELECT name 
FROM facts
WHERE population_growth = (SELECT MAX(population_growth) FROM facts )

 * sqlite:///factbook.db
Done.

[('South Sudan',)]

Which country will add most people to their population next year?

In [28]:
%%sql
SELECT name, migration_rate
FROM facts
WHERE migration_rate = (SELECT MAX(migration_rate) FROM facts);

 * sqlite:///factbook.db
Done.

[('Qatar', 22.39)]

Which country have a higher death rate than birth rate?

In [30]:
%%sql
SELECT name, MAX(death_rate), MIN(birth_rate)
FROM facts

 * sqlite:///factbook.db
Done.

[('Monaco', 14.89, 6.65)]